Documents/упДвижениеДокументовРейса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>упДвижениеДокументовРейса</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УдалитьупОстаткиДокументовПоРейсу</xr:Item>
				<xr:Item>AccumulationRegister.упНепереданныеДокументы</xr:Item>
				<xr:Item>InformationRegister.упРаботыПоРейсу</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Рейс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упРейс</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвратДокументовПослеИсполненияРейса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторРаботы</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Задание</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.упЗаданиеНаПеревозкуГруза</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Операция</Name>
							<Type>
								<v8:Type>cfg:EnumRef.упТипыОпераций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипРегламентногоДокумента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упТипыРегламентныхДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЭкземпляровДокумента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДокументыПоРейсу</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УдалитьЗаказчик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упПартнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаданиеНаПеревозку</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.упЗаданиеНаПеревозкуГруза</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипРегламентногоДокумента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упТипыРегламентныхДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Операция</Name>
							<Type>
								<v8:Type>cfg:EnumRef.упТипыОпераций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭкземплярДокумента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упЭкземплярыДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/упРаботыПоРейсу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упРаботыПоРейсу</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Отменена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Задание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упЗаданиеНаПеревозкуГруза</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упТипыОпераций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДополнительнаяОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упДополнительныеОперации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяРабот</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВремяРаботы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВременноеОкноНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВременноеОкноОкончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрузовоеМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГрузовыеМеста</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяОжидания</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВремяРаботы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлановоеВремяНачалаРабот</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоГрузов</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоГрузов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоДопОпераций</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоОпераций</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Проблема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПроблемы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресРазгрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упАдреса</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Выполнена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроблемаПричинаВозникновенияЭтойРаботы</Name>
					<Comment>Хранится последующее действие по работе после разгрузки (отмена работы, возврат в планирование)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.упПроблемы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипРегламентногоДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТипыРегламентныхДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЭкземпляровДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПартнеры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Масса</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Масса</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Объем</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Тара</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГрузовыеМеста</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрузРазделен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СкладскаяЯчейка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отложена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапрещеноСозданиеНовойТочкиМаршрута</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Рейс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упРейс</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторРаботы</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтрокаНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/упНепереданныеДокументы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>упНепереданныеДокументы</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Рейс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упРейс</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаданиеНаПеревозку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упЗаданиеНаПеревозкуГруза</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипРегламентногоДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТипыРегламентныхДокументов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭкземплярДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упЭкземплярыДокументов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упТипыОпераций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/упСтатусыРейса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упСтатусыРейса</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КПланированиюТС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СформированыЗаявкиНаТС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НазначеноТС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КВыполнению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполняется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыполненЧастично</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/упТипыОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упТипыОпераций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Погрузка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разгрузка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаДокументов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеДокументов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительнаяОперация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыемкаЦенностей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаЦенностей</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/упДвижениеДокументовРейса/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Выполним формирование движений документа.
//
// Параметры:
//  Рейс  - ДокументСсылка.упРейс - Ссылка на документ.
//  ТекстОшибки  - Строка - Текстовое представлениеошибки.
//  Отказ  - Булево - Флаг что произошел отказ создания движения.
//
// Возвращаемое значение:
//   ДокументСсылка   - Ссылка на документ.
//
Функция СформироватьДвижениеДокументовРейса(Рейс, ТекстОшибки, Отказ) Экспорт
	
	текДокумент = Неопределено;
	
	Статус = Документы.упРейс.ПолучитьСтатус(Рейс);
	Если Не (Статус = Перечисления.упСтатусыРейса.ВыполненЧастично 
				Или	Статус = Перечисления.упСтатусыРейса.Выполнен 
				Или Статус = Перечисления.упСтатусыРейса.Завершен) Тогда
		ТекстОшибки = НСтр("ru = 'Запрещено отражение непереданных/недополученных документов по рейсу пока он не выполнен или не завершен'");
		Отказ = Истина;
	КонецЕсли; 
	
	Если Не Отказ Тогда
		
		ТаблицаОстатков = ПолучитьОстаткиПоДвижениямДокументовРейса(Рейс);
		Если ТаблицаОстатков = Неопределено Тогда
			ТекстОшибки = НСтр("ru = 'По рейсу отсутствуют непереданные/недополученные документы. Создание документа невозможно'");
			Отказ = Истина;
			
		Иначе
			НовыйДокумент = Документы.упДвижениеДокументовРейса.СоздатьДокумент();
			НовыйДокумент.Дата = ТекущаяДатаСеанса();
			НовыйДокумент.Рейс = Рейс;
			Для каждого текСтрока Из ТаблицаОстатков Цикл
				ЗаполнитьЗначенияСвойств(НовыйДокумент.Работы.Добавить(), текСтрока);
			КонецЦикла;
			
			НовыйДокумент.Записать();
			текДокумент = НовыйДокумент.Ссылка;
			
		КонецЕсли;	
	КонецЕсли;
	
	Возврат текДокумент;
	
КонецФункции // СформироватьДвижениеДокументовРейса()

// Выполним формирование движений документа.
//
// Параметры:
//  Рейс  - ДокументСсылка.упРейс - Ссылка на документ.
//  ТекстОшибки  - Строка - Текстовое представлениеошибки.
//  Отказ  - Булево - Флаг что произошел отказ создания движения.
//
// Возвращаемое значение:
//   ДокументСсылка   - Ссылка на документ.
//
Функция СформироватьВозвратДокументовПослеИсполненияРейса(Рейс, ТекстОшибки, Отказ) Экспорт
	
	текДокумент = Неопределено;
	
	Статус = Документы.упРейс.ПолучитьСтатус(Рейс);
	Если Не (Статус = Перечисления.упСтатусыРейса.ВыполненЧастично  
				Или Статус = Перечисления.упСтатусыРейса.Выполнен 
				Или Статус = Перечисления.упСтатусыРейса.Завершен) Тогда
		ТекстОшибки = НСтр("ru = 'Запрещено отражение непереданных/недополученных документов по рейсу пока он не выполнен или не завершен'");
		Отказ = Истина;
	КонецЕсли; 
	
	Если Не Отказ Тогда
		
		ТаблицаОстатков = ПолучитьОстаткиПоНевозвращеннымДокументам(Рейс);
		Если ТаблицаОстатков = Неопределено Тогда
			ТекстОшибки = НСтр("ru = 'По рейсу отсутствуют невозвращенные документы. Создание документа невозможно'");
			Отказ = Истина;
			
		Иначе
			НовыйДокумент = Документы.упДвижениеДокументовРейса.СоздатьДокумент();
			НовыйДокумент.Дата = ТекущаяДатаСеанса();
			НовыйДокумент.Рейс = Рейс;
			НовыйДокумент.ВозвратДокументовПослеИсполненияРейса = Истина;
			Для каждого текСтрока Из ТаблицаОстатков Цикл
				ЗаполнитьЗначенияСвойств(НовыйДокумент.ДокументыПоРейсу.Добавить(), текСтрока);
			КонецЦикла;
			
			НовыйДокумент.Записать();
			текДокумент = НовыйДокумент.Ссылка;
			
		КонецЕсли;	
	КонецЕсли;
	
	Возврат текДокумент;	
	
КонецФункции // СформироватьВозвратДокументовПослеИсполненияРейса()

// Получим остаток по документу рейс.
//
// Параметры:
//  Рейс  - ДокументСсылка.упРейс - Ссылка на документ.
//  Регистратор  - ДокументСсылка - Ссылка на документ.
//
// Возвращаемое значение:
//   ТаблицаЗначений   - Ответ проверки.
//
Функция ПолучитьОстаткиПоДвижениямДокументовРейса(Рейс, Регистратор = Неопределено) Экспорт
	
	ТаблицаОстатков = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	упРаботыПоРейсу.Идентификатор,
	|	упРаботыПоРейсу.ИдентификаторРаботы,
	|	упРаботыПоРейсу.Задание,
	|	упРаботыПоРейсу.Операция,
	|	упРаботыПоРейсу.ТипРегламентногоДокумента,
	|	СУММА(упРаботыПоРейсу.КоличествоЭкземпляровДокумента) КАК КоличествоЭкземпляровДокумента
	|ПОМЕСТИТЬ втПлановыеРаботы
	|ИЗ
	|	РегистрСведений.упРаботыПоРейсу КАК упРаботыПоРейсу
	|ГДЕ
	|	упРаботыПоРейсу.Регистратор = &Рейс
	|	И упРаботыПоРейсу.Операция В (ЗНАЧЕНИЕ(Перечисление.упТипыОпераций.ПолучениеДокументов), ЗНАЧЕНИЕ(Перечисление.упТипыОпераций.ПередачаДокументов))
	|
	|СГРУППИРОВАТЬ ПО
	|	упРаботыПоРейсу.Идентификатор,
	|	упРаботыПоРейсу.ИдентификаторРаботы,
	|	упРаботыПоРейсу.Задание,
	|	упРаботыПоРейсу.Операция,
	|	упРаботыПоРейсу.ТипРегламентногоДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	упРаботыПоРейсу.Идентификатор,
	|	упРаботыПоРейсу.ИдентификаторРаботы,
	|	упРаботыПоРейсу.Задание,
	|	упРаботыПоРейсу.Операция,
	|	упРаботыПоРейсу.ТипРегламентногоДокумента,
	|	упРаботыПоРейсу.КоличествоЭкземпляровДокумента
	|ПОМЕСТИТЬ втФактическиеРаботыПодготовка
	|ИЗ
	|	РегистрСведений.упРаботыПоРейсу.СрезПоследних(, Рейс = &Рейс) КАК упРаботыПоРейсу
	|ГДЕ
	|	упРаботыПоРейсу.Операция В (ЗНАЧЕНИЕ(Перечисление.упТипыОпераций.ПолучениеДокументов), ЗНАЧЕНИЕ(Перечисление.упТипыОпераций.ПередачаДокументов))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	упРаботыПоРейсу.Идентификатор,
	|	упРаботыПоРейсу.ИдентификаторРаботы,
	|	упРаботыПоРейсу.Задание,
	|	упРаботыПоРейсу.Операция,
	|	упРаботыПоРейсу.ТипРегламентногоДокумента,
	|	-упРаботыПоРейсу.КоличествоЭкземпляровДокумента
	|ИЗ
	|	РегистрСведений.упРаботыПоРейсу КАК упРаботыПоРейсу
	|ГДЕ
	|	упРаботыПоРейсу.Регистратор = &Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втФактическиеРаботы.Идентификатор,
	|	втФактическиеРаботы.ИдентификаторРаботы,
	|	втФактическиеРаботы.Задание,
	|	втФактическиеРаботы.Операция,
	|	втФактическиеРаботы.ТипРегламентногоДокумента,
	|	СУММА(втФактическиеРаботы.КоличествоЭкземпляровДокумента) КАК КоличествоЭкземпляровДокумента
	|ПОМЕСТИТЬ втФактическиеРаботы
	|ИЗ
	|	втФактическиеРаботыПодготовка КАК втФактическиеРаботы
	|
	|СГРУППИРОВАТЬ ПО
	|	втФактическиеРаботы.Идентификатор,
	|	втФактическиеРаботы.ИдентификаторРаботы,
	|	втФактическиеРаботы.Задание,
	|	втФактическиеРаботы.Операция,
	|	втФактическиеРаботы.ТипРегламентногоДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПлановыеРаботы.Идентификатор,
	|	втПлановыеРаботы.ИдентификаторРаботы,
	|	втПлановыеРаботы.Задание,
	|	втПлановыеРаботы.Операция,
	|	втПлановыеРаботы.ТипРегламентногоДокумента,
	|	втПлановыеРаботы.КоличествоЭкземпляровДокумента - ЕСТЬNULL(втФактическиеРаботы.КоличествоЭкземпляровДокумента, 0) КАК КоличествоЭкземпляровДокумента
	|ИЗ
	|	втПлановыеРаботы КАК втПлановыеРаботы
	|		ЛЕВОЕ СОЕДИНЕНИЕ втФактическиеРаботы КАК втФактическиеРаботы
	|		ПО втПлановыеРаботы.Идентификатор = втФактическиеРаботы.Идентификатор
	|			И втПлановыеРаботы.ИдентификаторРаботы = втФактическиеРаботы.ИдентификаторРаботы
	|			И втПлановыеРаботы.Задание = втФактическиеРаботы.Задание
	|			И втПлановыеРаботы.Операция = втФактическиеРаботы.Операция
	|			И втПлановыеРаботы.ТипРегламентногоДокумента = втФактическиеРаботы.ТипРегламентногоДокумента
	|ГДЕ
	|	втПлановыеРаботы.КоличествоЭкземпляровДокумента - ЕСТЬNULL(втФактическиеРаботы.КоличествоЭкземпляровДокумента, 0) > 0";
	Запрос.УстановитьПараметр("Рейс", Рейс);
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		ТаблицаОстатков = Результат.Выгрузить();
	КонецЕсли; 
	
	Возврат ТаблицаОстатков;
	
КонецФункции

// Получим остаток по документу рейс.
//
// Параметры:
//  Рейс  - ДокументСсылка.упРейс - Ссылка на документ.
//  Регистратор  - ДокументСсылка - Ссылка на документ.
//
// Возвращаемое значение:
//   ТаблицаЗначений   - Ответ проверки.
//
Функция ПолучитьОстаткиПоНевозвращеннымДокументам(Рейс, Регистратор = Неопределено) Экспорт
	
	ТаблицаОстатков = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упНепереданныеДокументыОстатки.ЗаданиеНаПеревозку,
	|	упНепереданныеДокументыОстатки.ТипРегламентногоДокумента,
	|	упНепереданныеДокументыОстатки.Операция,
	|	упНепереданныеДокументыОстатки.ЭкземплярДокумента,
	|	упНепереданныеДокументыОстатки.КоличествоОстаток
	|ПОМЕСТИТЬ втОстатки
	|ИЗ
	|	РегистрНакопления.упНепереданныеДокументы.Остатки(, Рейс = &Рейс) КАК упНепереданныеДокументыОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	упНепереданныеДокументы.ЗаданиеНаПеревозку,
	|	упНепереданныеДокументы.ТипРегламентногоДокумента,
	|	упНепереданныеДокументы.Операция,
	|	упНепереданныеДокументы.ЭкземплярДокумента,
	|	-упНепереданныеДокументы.Количество
	|ИЗ
	|	РегистрНакопления.упНепереданныеДокументы КАК упНепереданныеДокументы
	|ГДЕ
	|	упНепереданныеДокументы.Рейс = &Рейс
	|	И упНепереданныеДокументы.Регистратор = &Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втОстатки.ЗаданиеНаПеревозку,
	|	втОстатки.ТипРегламентногоДокумента,
	|	втОстатки.Операция,
	|	втОстатки.ЭкземплярДокумента,
	|	СУММА(втОстатки.КоличествоОстаток) КАК Количество
	|ИЗ
	|	втОстатки КАК втОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	втОстатки.ЗаданиеНаПеревозку,
	|	втОстатки.ТипРегламентногоДокумента,
	|	втОстатки.Операция,
	|	втОстатки.ЭкземплярДокумента
	|
	|ИМЕЮЩИЕ
	|	СУММА(втОстатки.КоличествоОстаток) > 0";
	Запрос.УстановитьПараметр("Рейс", Рейс);
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		ТаблицаОстатков = Результат.Выгрузить();
	КонецЕсли; 
	
	Возврат ТаблицаОстатков;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Нет.

#КонецОбласти

#КонецЕсли
